app/views/clubs/_form.html.erb

        <%= f.label :club_types %><br>
        <%= f.collection_check_boxes :club_type_ids, ClubType.all, :id, :name %>
---
SELECT "club_types".* FROM "club_types"

        <%= f.label :major_ids %><br>
        <%= f.collection_check_boxes :major_ids, Major.all, :id, :name %>
---
SELECT "majors".* FROM "majors"