app/views/users/_form.html.erb

    <%= f.label :club_ids, 'Clubs You Manage' %>
    <%= f.collection_check_boxes(:club_ids, Club.all, :id, :name)  do |b|
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL