app/views/home/club.erb

SELECT "majors".* FROM "majors" INNER JOIN "clubs_majors" ON "majors"."id" = "clubs_majors"."major_id" WHERE "clubs_majors"."club_id" = ?  [["club_id", 7]]
SELECT COUNT(*) FROM "majors" INNER JOIN "clubs_majors" ON "majors"."id" = "clubs_majors"."major_id" WHERE "clubs_majors"."club_id" = ?  [["club_id", 1]]
---
          <% end %>
          <% if @club.majors.count > 0 %>