app/views/home/list.erb

SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL
---
              <td>
                <% c.club_types.each do |t| %>