app/controllers/clubs_controller.rb

  def index
    @clubs = Club.all.order(:name)
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL  ORDER BY "clubs"."name" ASC

  def create
    @club = Club.new(club_params)
    @club.club_type_ids = club_type_ids
    @club.major_ids = major_ids
    respond_to do |format|
      if @club.save
---
INSERT INTO "clubs" ("created_at", "description", "email", "joining", "logo", "name", "president", "updated_at", "website", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      @club.club_type_ids = club_type_ids
      @club.major_ids = major_ids
      if @club.update(club_params)
---
UPDATE "clubs" SET "joining" = ?, "updated_at" = ? WHERE "clubs"."id" = 5  [["joining", "Join us at our ASCE Open House in Fall Quarter or email us!\r\n\r\n\r\nEDIT"], ["updated_at", "2014-05-31 07:15:17.462974"]]

    def set_club
      @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL AND "clubs"."id" = ? LIMIT 1  [["id", 1]]