app/controllers/home_controller.rb

  def list
    @clubs = Club.all
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL