app/controllers/home_controller.rb

  def list
    @clubs = Club.all.order(:name)
    @club_types = ClubType.all
    @majors = Major.all
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL  ORDER BY "clubs"."name" ASC
SELECT "club_types".* FROM "club_types"
SELECT "majors".* FROM "majors"

  def club
    @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL AND "clubs"."id" = ? LIMIT 1  [["id", 1]]