app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"  WHERE "users"."deleted_at" IS NULL

  def dashboard
    if @user.site_admin
      @clubs = Club.all.order(:name)
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."deleted_at" IS NULL  ORDER BY "clubs"."name" ASC

  def create
    @user = User.new(user_params)
    @user.club_ids = user_params[:club_ids]
    respond_to do |format|
      if @user.save
---
INSERT INTO "club_users" ("club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["club_id", 5], ["created_at", "2014-05-31 07:14:29.213605"], ["updated_at", "2014-05-31 07:14:29.213605"], ["user_id", 3]]
INSERT INTO "users" ("created_at", "email", "name", "site_admin", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-04-13 06:15:48.492233"], ["email", "shannon.tan1994@gmail.com"], ["name", "super_user"], ["site_admin", "t"], ["updated_at", "2014-04-13 06:15:48.492233"]]

  def update
    respond_to do |format|
      @user.club_ids = user_params[:club_ids]
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["email", "shannon.tan1994@gmail.com"], ["updated_at", "2014-05-31 06:57:47.165619"]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT 1  [["id", 1]]